["2017-02-18T20:00:00+00:00Saturday, February 18, 12:00: Noisebridge Mini-Reboot 2017, 18 & 19-Feb-2017 Mini-Reboot Come join us in Hacking Noisebridge to make it an even cooler place to be\nAnyone is welcome to come and help with this event. Contact \"J\" for more information. ","2017-03-02T03:00:00+00:00Wednesday, March 1, 19:00: Dorkbot, Dorkbot is a social gathering of dorks, nerds, and geeks including 3 presentations that somehow explore intersections of art & tech.  Presentations for this Dorkbot inlclude:  Kal Spelitich & Mitch Altman \"Harvesting Brain DATA for Robotic Mayhem and Enlightenment\", Terbo Ted on his new sci fi novel about a journalist falling in love love with an AI, and Mark Meadows on the pluses and minuses of bots.","2017-03-08T03:00:00+00:00Tuesday, March 7, 19:00: SF Awesome Foundation meeting, The Awesome Foundation has chapters all over the world.  Each chapter gives a monthly grant of $1k to an awesome project -- no strings attached.  If you have a project you feel is awesome, please submit it!  The San Francisco chapter will have its March meeting in the Turing classroom.","2017-03-11T20:00:00+00:00Saturday, March 11, 12:00: GODWAFFLE NOISE PANCAKES, The 11-Mar-2017 GODWAFFLE NOISE PANCAKES has experimental acts, electronic sounds, & noise, with gourmet vegan pancakes!\nBands: I Should Have Cut The Eyes Different (Branpos/Ingalls/Grusel), Turjurikkuja, Jen Belleville & Kevin Cocoran, Coconut, Clarke Robinson","2017-03-18T20:00:00+00:00Saturday, March 18, 13:00: Arduino For Total Newbies workshop, This Arduino For Total Newbies workshop is a fun, easy way to learn all you need to play with Arduino and make your own projects.Arduino is a powerful way to make things blink, move, and make noise!Anyone can learn.  All are welcome!1:00pm - 4:30pmCost:  $35 for materials.","2017-03-26T19:00:00+00:00Sunday, March 26, 12:00: GSM Anomaly Detection Workshop (Hackatorium),  We will assemble inexpensive (~$150 each, BYO parts) sensors and configure the service for aggregating GSM network information!  The whole system (aggregation service plus sensors) is open-source, and the parts are easy to obtain via online maker-oriented vendors.  Bring the parts and an AWS/Digital Ocean/${FAVORITE_IAAS_PROVIDER} login, because you'll need somewhere to send the information to, and we'll all leave with our very own cellular anomaly detection systems!Parts list on this page: Sensor","2017-04-08T19:00:00+00:00Saturday, April 8, 12:00: GODWAFFLE NOISE PANCAKES, The 08-Apr-2017 GODWAFFLE NOISE PANCAKES has experimental acts, electronic sounds, & noise, with gourmet vegan pancakes!\nBands: Mochipet, Tom Djill, Bloody Snowman, Mas Coad, +++TBA++","2017-05-13T19:00:00+00:00Saturday, May 13, 12:00: GODWAFFLE NOISE PANCAKES, The 13-May-2017 GODWAFFLE NOISE PANCAKES has experimental acts, electronic sounds, & noise, with gourmet vegan pancakes!\nBands: Microwave Windows, Syrnx, Fistortion, Nurse Betty, Series Premiere","2017-05-18T15:00:00+00:00Thursday, May 18, 08:00: Maker Faire 2017, Maker Faire 2017 - setup day  Thursday morning we'll meet to load a truck with our Maker Faire stuff and take it down to San Mateo for setup.","2017-05-19T16:00:00+00:00Friday, May 19, 09:00: Maker Faire 2017, Maker Faire 2017 - setup and show day  We'll be fixing anything we broke during setup, or forgot to bring. Then telling people about Noisebridge and showing off what we've made here in the space. (Time to be corrected as details arrive.)","2017-05-20T16:00:00+00:00Saturday, May 20, 09:00: Maker Faire 2017, Maker Faire 2017 - show day  Well be telling people about Noisebridge and showing off what we've made here in the space. Hackers are ok.  (Time to be corrected as details arrive.)","2017-05-21T16:00:00+00:00Sunday, May 21, 09:00: Maker Faire 2017, Maker Faire 2017 - show day and tear down  We'll be telling people about Noisebridge and showing off what we've made here in the space. At the end of the show, we'll take it all back home to Noisebridge.  (Time to be corrected as details arrive.)"]