["","  Recurring Events edit ","E - Every week.","1st - Certain weeks, e.g. 1st week only.","-2nd - Except certain weeks, or other schedule exceptions.","","  Mondays "," E 7:00 pm to 9:00 pm Circuit Hacking Mondays Learn to solder! And make cool things with electronics. Mitch, J, Rolf, Miloh, Cedric, Cheng, Greg, and/or a host of others will bring kits-for-purchase to make cool, hackable things for all skill levels that you can bring home after you make them! Many designed for absolute beginners! Bring your own projects to hack! Bring things to fix! All ages. All are welcome! See the Discuss list and the Announce list for weekly updates."," E Take Out the Trash Night -- Round One Be sure to put bins out by midnight as the trash truck comes between 1:30 to 2:30am."," E 7:00 pm to 9:00 pm Intermediate Python with PyClass - Crash course in the Python standard library. Monday session is held in Church Classroom.","","  Super Tuesdays! "," E 5:00 pm to 7:30 pm Songbridge Music Making Tuesdays - Beginner-friendly music making and mentoring meetup with Ableton/GarageBand/Logic tutorials for beginners and peer collabs. (Noise Square Table)."," 1st 3rd  6:30 pm to 8:30 pm Sewing and Crafting - Come learn how to use the sewing machines or just work on a craft (e.g. knitting, crocheting, felt working, embroidery, leatherworking, beading, etc.). All skill levels are welcome. "," E 8:30 pm to 11:30 pm Gamebridge Unityversity Game Dev Tuesdays - Beginner-friendly game development class and meetup, learn and share C# Unity coding, 2D/3D art, design, writing and audio. Learn how to mentor and help teach game dev. (Noise Square Table)."," E 8:00 pm Noisebridge Weekly Meeting - Introducing new people and events to the space, general discussion, and decision-making on key issues. This is your space, folks. Come on out here in person to express what you think about what's going on with it!","","  Wednesdays "," alternating monthly 6:30 pm to 9:30 pm - Cyberspectrum: Software Defined Radio Meetup in the Hackatorium(new): A place to learn and exchange ideas about SDR. Presentations on concepts, mystery signals, hardware/software and cool applications. Event alternates monthly between SF and the South Bay."," 1st Wednesday of every month, 7:30-9. with Software; Art()  Present your personal and expressive art made with software/hardware of your own making and get feedback and critical dialogue from fellow artist/technologists.   [Last updated Feb 1, 2017]."," E 8:00 pm to 10:00 pm  Dream Team Neuro Hackery - EEG research & development project with general interest in sleep, dreaming, creative intelligence, and many loosely related topics such as: neurophysiology, signal processing, cognitive neuroscience, and (especially) hacking code and devices for data acquisition and analysis.  Join us at the CollaborationStation (near the Hackatorium).  Expect general discussion around 8 PM - usually moving along by 9 PM to focus on more technical aspects of current project."," E 7:30 pm to 9:00 pm  - Career Change: How to kickstart your new career in web development","","  Thursdays "," E Trash Night -- Round Two  - Take out the trash for Friday morning! Do it by midnight as truck comes ~1:30am to 2:30am."," E 7:30 pm to 10:00 pm The Go group meets up on Wednesdays and Thursdays to play."," E 8:00 pm to 9:00pm Five Minutes of Fame a.k.a. 5MoF - Ten 5min talks in an hour, on any topic! Small 5MoFs every Thursday-ish, bigger ones on the 3rd Thursday of the month. "," biweekly 7:00 pm to 8:30 pm Programming for Interviews every other Thursday evening. RSVP on meetup.com"," biweekly 7:00 pm to 8:30 pm Laser Safety Training every other Thursday evening. RSVP on meetup.com","","  Fridays "," 1st 3rd 5th  6:00 pm to 8:00 pm Computerology in Turing or  CollaborationStation, understanding and using computers"," 1st 3rd 5th  8:00 pm to 10:00 pm FUN Tutoring @ CollaborationStation"," 3rd Noisebridge Gaming Archivists Meetup 6:00 pm to 10:00 pm -- Come play, fix, mod retro consoles. Create and play is our motto! If you like video games, this is the place for you.","","  Saturdays ","nothing!","","  Sundays "," alternating monthly 1:00 pm Monthly Lock Sport Collaboration: Come learn how to pick locks and learn more about them with the SF Bay Area chapter of TOOOL. The group meets on alternating  months at Noisebridge and in San Jose. Check the TOOOL SF announcement list for details. "," E 3:00 pm Go - Playing of the Go board game. On nice days we often take the boards to Dolores Park and play there."," E 12:00 pm to 4:00 pm .impact Workathons in Turing classrom. Work on projects that will help humanity & beyond.","",""]